pinterest/app/models/user.rb

	def reset_session_token
		self.session_token = self.class.generate_session_token
		self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-KpUVcEF9H2cTj7z_C20Ig"], ["updated_at", "2019-09-04 05:02:53.217662"], ["id", 4]]