app/controllers/api/boards_controller.rb

	def create
		@board = Board.new(board_params)
		@board.authorId = current_user.id
		if @board.save
---
INSERT INTO "boards" ("authorId", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["authorId", 22], ["title", "title is 1"], ["description", "description is 2"], ["created_at", "2019-10-11 19:57:29.747840"], ["updated_at", "2019-10-11 19:57:29.747840"]]

	def destroy
		@board = Board.find(params[:id])
		@board.destroy
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 11]]