app/controllers/api/items_controller.rb

	def create
		@item = Item.new(item_params)
		@item.authorId = current_user.id
		@item.boardId =
		@item.pinId =
		if @item.save
---
INSERT INTO "items" ("boardId", "pinId", "authorId", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["boardId", 2], ["pinId", 17], ["authorId", 4], ["title", "new pin 1"], ["description", "board_2"], ["created_at", "2019-10-18 05:52:18.060617"], ["updated_at", "2019-10-18 05:52:18.060617"]]