app/controllers/api/pins_controller.rb

	def create
		@pin = Pin.new(pin_params)
		@pin.authorId = current_user.id
		# @item = Item.new(item_params)

		if @pin.save # && @item.save
---
INSERT INTO "pins" ("authorId", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["authorId", 8], ["link", "www.pinterest.com"], ["created_at", "2019-10-18 04:05:23.353270"], ["updated_at", "2019-10-18 04:05:23.353270"]]