app/views/api/boards/_board.json.jbuilder


json.pinIds board.pins.ids # array of ids
---
SELECT "pins".* FROM "pins" INNER JOIN "board_pins" ON "pins"."id" = "board_pins"."pinId" WHERE "board_pins"."boardId" = $1  [["boardId", 7]]