app/views/api/boards/_board.json.jbuilder

SELECT "items"."id" FROM "items" WHERE "items"."boardId" = $1  [["boardId", 1]]
---

json.itemIds board.items.ids # array of ids