app/views/api/boards/show.json.jbuilder

json.items do
	@board.items.each do |item|
---
SELECT "items"."id" FROM "items" WHERE "items"."boardId" = $1  [["boardId", 1]]