app/views/api/boards/show.json.jbuilder

SELECT "pins".* FROM "pins" INNER JOIN "items" ON "pins"."id" = "items"."pinId" WHERE "items"."boardId" = $1  [["boardId", 4]]
---
json.pins do
	@board.pins.each do |pin|