app/controllers/application_controller.rb

	def current_user
		has_token = session[:session_token]
		return nil unless has_token
		@current_user ||= User.find_by_session_token(has_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "Mc5tZBajQZTD5gu3teq4Hw"], ["LIMIT", 1]]