app/models/user.rb

	def reset_session_token
		self.session_token = self.class.generate_session_token
		self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Mc5tZBajQZTD5gu3teq4Hw"], ["updated_at", "2019-10-16 15:02:24.152611"], ["id", 4]]